:PROPERTIES:
:ID:       9828d7bf-39e6-4bd6-9d6a-0986b77c47a4
:END:
#+TITLE: DCIM
#+DESCRIPTION: Network Source of Truth
#+TAGS:



**** From nautobot repos
:PROPERTIES:
:header-args:shell+: :dir (or (bound-and-true-p -nauto-root-dir-) (expand-file-name "dcim/nautobot" (getenv "_ECTO")))
:END:

#+begin_src shell :results output code :wrap example
find . -name "*.sql"
#+end_src

#+RESULTS:
#+begin_example
./nautobot-app-chatops/development/mattermost/dump.sql
./100-days-of-nautobot/Lab_Setup/database_files/nautobot-demo.sql
./nautobot/development/mysql-unittests.sql
./cookiecutter-nautobot-app/nautobot-app-chatops/{{ cookiecutter.project_slug }}/development/mattermost/dump.sql
./nautobot-app-netbox-importer/nautobot_netbox_importer/tests/fixtures/nautobot-v2.4/dump.sql
#+end_example

**** From netbox-community repos
:PROPERTIES:
:header-args:shell+: :dir (or (bound-and-true-p -nbc-root-dir-) (expand-file-name "dcim/netbox-community" (getenv "_ECTO")))
:END:

... well that was easy

#+begin_src shell :results output code :wrap example
find . -name "*.sql"
#+end_src

#+RESULTS:
#+begin_example
./netbox-operator/kind/load-data-job/local-data-setup.sql
./netbox-demo-data/sql/netbox-demo-v3.6.sql
./netbox-demo-data/sql/netbox-demo-v4.3.sql
./netbox-demo-data/sql/netbox-demo-v4.1.sql
./netbox-demo-data/sql/netbox-demo-v3.3.sql
./netbox-demo-data/sql/netbox-demo-v3.4.sql
./netbox-demo-data/sql/netbox-demo-v3.0.sql
./netbox-demo-data/sql/netbox-demo-v4.2.sql
./netbox-demo-data/sql/netbox-demo-v4.0.sql
./netbox-demo-data/sql/netbox-demo-v3.1.sql
./netbox-demo-data/sql/netbox-demo-v3.7.sql
./netbox-demo-data/sql/netbox-demo-v3.5.sql
./netbox-demo-data/sql/netbox-demo-v3.2.sql
#+end_example

***** From netbox-community/netbox-demo-data

What's in here anyways?

+ =uniq --count= can exclude the first n fields ... so we =〈 rev | . | rev 〉=

#+begin_src shell
pgdump=netbox-demo-data/sql/netbox-demo-v4.3.sql
grep -e '^CREATE' $pgdump
    | cut -f2-3 -d' ' | grep -v 'UNIQUE' | sort \
    | rev | uniq --count -f1 | rev \
    | cut -f1,3 -d' '
#+end_src

#+RESULTS:
| COLLATION |   1 |
| INDEX     | 205 |
| TABLE     | 191 |


